Repository: HamGuy/CCSwitch
Catalog: ccswitch-mac/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Active
zh_hans: 当前活动
zh_hk: 目前啟用

source: Add Configuration...
zh_hans: 添加配置...
zh_hk: 新增配置...

source: Add New Configuration
zh_hans: 添加新配置
zh_hk: 新增配置

source: All Configurations
zh_hans: 所有配置
zh_hk: 所有配置

source: API Token cannot be empty
zh_hans: API Token 不能为空
zh_hk: API Token 不能為空

source: API Token must start with sk-
zh_hans: API Token 必须以 sk- 开头
zh_hk: API Token 必須以 sk- 開頭

source: API URL cannot be empty
zh_hans: API URL 不能为空
zh_hk: API URL 不能為空

source: API URL must use HTTPS protocol
zh_hans: API URL 必须使用 HTTPS 协议
zh_hk: API URL 必須使用 HTTPS 協議

source: Are you sure you want to delete the configuration '%@'? This action cannot be undone.
zh_hans: 确定要删除配置 '%@' 吗？此操作无法撤销。
zh_hk: 確定要刪除配置 '%@' 嗎？此操作無法復原。

source: Are you sure you want to delete this configuration? This action cannot be undone.
zh_hans: 确定要删除此配置吗？此操作无法撤销。
zh_hk: 確定要刪除此配置嗎？此操作無法復原。

source: Are you sure you want to reset all settings to their default values?
zh_hans: 确定要重置所有设置为默认值吗？
zh_hk: 確定要重設所有設定為預設值嗎？

source: Auto-detected configuration file path:
zh_hans: 自动检测的配置文件路径:
zh_hk: 自動偵測的配置檔路徑:

source: Automatically start CCSwitch when you log in
zh_hans: 登录时自动启动 CCSwitch
zh_hk: 登入時自動啟動 CCSwitch

source: Browse...
zh_hans: 浏览...
zh_hk: 瀏覽...

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: CCSwitch is a menu bar application that helps you quickly switch between different Claude Code API configurations. The app comes with several common configuration types pre-configured. You can click the menu bar icon to view and manage these configurations.
zh_hans: CCSwitch 是一个菜单栏应用，可以帮助您快速切换不同的 Claude Code API 配置。 应用已预设了几种常用的配置类型，您可以点击菜单栏图标查看和管理这些配置。
zh_hk: CCSwitch 是一個選單列應用程式，可以幫助您快速切換不同的 Claude Code API 配置。 應用程式已預設了幾種常用的配置類型，您可以點擊選單列圖示檢視和管理這些配置。

source: CCSwitch needs to modify your shell configuration file to set environment variables. If automatic detection fails, you can manually specify the file path.
zh_hans: CCSwitch 需要修改您的 Shell 配置文件来设置环境变量。如果自动检测失败，您可以手动指定配置文件路径。
zh_hk: CCSwitch 需要修改您的 Shell 配置檔來設定環境變數。如果自動偵測失敗，您可以手動指定配置檔路徑。

source: CCSwitch Settings
zh_hans: CCSwitch 设置
zh_hk: CCSwitch 設定

source: Close
zh_hans: 关闭
zh_hk: 關閉

source: Config Path
zh_hans: 配置路径
zh_hk: 配置路徑

source: Configuration file path (e.g., ~/.zshrc)
zh_hans: 配置文件路径 (例如: ~/.zshrc)
zh_hk: 配置檔路徑 (例如: ~/.zshrc)

source: Configuration file test failed: %@
zh_hans: 配置文件测试失败： %@
zh_hk: 配置檔測試失敗： %@

source: Configuration file test passed! Path: %@
zh_hans: 配置文件测试通过！ 路径: %@
zh_hk: 配置檔測試通過！ 路徑: %@

source: Configuration Name
zh_hans: 配置名称
zh_hk: 配置名稱

source: Configuration name cannot be empty
zh_hans: 配置名称不能为空
zh_hk: 配置名稱不能為空

source: Configuration name is too long, maximum 50 characters
zh_hans: 配置名称过长，最多 50 个字符
zh_hk: 配置名稱過長，最多 50 個字元

source: Configuration Test Result
zh_hans: 配置测试结果
zh_hk: 配置測試結果

source: Configuration Type
zh_hans: 配置类型
zh_hk: 配置類型

source: Configurations
zh_hans: 配置
zh_hk: 配置

source: Confirm Deletion
zh_hans: 确认删除
zh_hk: 確認刪除

source: Create a new configuration
zh_hans: 创建一个新的配置
zh_hk: 建立新配置

source: Current Configuration
zh_hans: 当前配置
zh_hk: 目前配置

source: Current Configuration:
zh_hans: 当前配置:
zh_hk: 目前配置:

source: Current: %@
zh_hans: 当前: %@
zh_hk: 目前: %@

source: Current: Default
zh_hans: 当前: 默认
zh_hk: 目前: 預設

source: Custom
zh_hans: 自定义
zh_hk: 自訂

source: Custom Configurations
zh_hans: 自定义配置
zh_hk: 自訂配置

source: Default
zh_hans: 默认
zh_hk: 預設

source: Delete
zh_hans: 删除
zh_hk: 刪除

source: Deletion Failed
zh_hans: 删除失败
zh_hk: 刪除失敗

source: Diagnostics and Testing
zh_hans: 诊断和测试
zh_hk: 診斷與測試

source: Edit
zh_hans: 编辑
zh_hk: 編輯

source: Edit Configuration
zh_hans: 编辑配置
zh_hk: 編輯配置

source: Enter API Token (sk-...)
zh_hans: 输入 API Token (sk-...)
zh_hk: 輸入 API Token (sk-...)

source: Enter API URL
zh_hans: 输入 API URL
zh_hk: 輸入 API URL

source: Enter configuration name
zh_hans: 输入配置名称
zh_hk: 輸入配置名稱

source: Error
zh_hans: 错误
zh_hk: 錯誤

source: File does not exist
zh_hans: 文件不存在
zh_hk: 檔案不存在

source: File is not readable
zh_hans: 文件不可读
zh_hk: 檔案不可讀

source: Get Started
zh_hans: 开始使用
zh_hk: 開始使用

source: Invalid API Token format, should start with sk-
zh_hans: API Token 格式无效，应以 sk- 开头
zh_hk: API Token 格式無效，應以 sk- 開頭

source: Invalid API URL format
zh_hans: API URL 格式无效
zh_hk: API URL 格式無效

source: Launch at login
zh_hans: 开机启动
zh_hk: 開機啟動

# launch.error.check.failed
source: Failed to check launch item status
zh_hans: 检查启动项状态失败
zh_hk: 檢查啟動項狀態失敗

# launch.error.create.failed
source: Failed to create launch item
zh_hans: 创建启动项失败
zh_hk: 建立啟動項失敗

# launch.error.permission.denied
source: Insufficient permissions
zh_hans: 权限不足
zh_hk: 權限不足

# launch.error.remove.failed
source: Failed to remove launch item
zh_hans: 移除启动项失败
zh_hk: 移除啟動項失敗

source: Management Options
zh_hans: 管理选项
zh_hk: 管理選項

source: Modify an existing configuration
zh_hans: 修改现有配置
zh_hk: 修改現有配置

source: More Configurations...
zh_hans: 更多配置...
zh_hk: 更多配置...

source: Official
zh_hans: 官方
zh_hk: 官方

source: Official configuration can omit Token
zh_hans: 官方配置可以不设置 Token
zh_hk: 官方配置可以不設定 Token

source: OK
zh_hans: 确定
zh_hk: 確定

source: Path cannot be empty
zh_hans: 路径不能为空
zh_hk: 路徑不能為空

source: Preset Configurations
zh_hans: 预设配置
zh_hk: 預設配置

source: Quit
zh_hans: 退出
zh_hk: 退出

source: Reset
zh_hans: 重置
zh_hk: 重設

source: Reset Settings
zh_hans: 重置设置
zh_hk: 重設設定

source: Reset to Default
zh_hans: 重置为默认
zh_hk: 重設為預設

source: Run Diagnostics
zh_hans: 运行诊断
zh_hk: 執行診斷

source: Save
zh_hans: 保存
zh_hk: 儲存

source: Select
zh_hans: 选择
zh_hk: 選擇

source: Select your Shell configuration file
zh_hans: 选择您的 Shell 配置文件
zh_hk: 選擇您的 Shell 配置檔

source: Settings saved successfully
zh_hans: 设置已成功保存
zh_hk: 設定已成功儲存

source: Settings...
zh_hans: 设置...
zh_hk: 設定...

# settings.subtitle
source: Configure application preferences and system settings
zh_hans: 配置应用偏好设置和系统设置
zh_hk: 配置應用程式偏好設定和系統設定

# settings.title
source: Settings
zh_hans: 设置
zh_hk: 設定

source: Shell Config
zh_hans: Shell 配置
zh_hk: Shell 配置

source: Shell Configuration File Settings
zh_hans: Shell 配置文件设置
zh_hk: Shell 配置檔設定

source: Startup
zh_hans: 启动
zh_hk: 啟動

source: Test Configuration
zh_hans: 测试配置
zh_hk: 測試配置

source: Unknown error
zh_hans: 未知错误
zh_hk: 未知錯誤

source: Use custom config file
zh_hans: 使用自定义配置文件
zh_hk: 使用自訂配置檔

source: Using preset URL: %@
zh_hans: 使用预设 URL: %@
zh_hk: 使用預設 URL: %@

source: View and manage all available configurations
zh_hans: 查看和管理所有可用的配置
zh_hk: 檢視並管理所有可用的配置

source: Welcome to CCSwitch
zh_hans: 欢迎使用 CCSwitch
zh_hk: 歡迎使用 CCSwitch
